Catalogs/Кошельки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Кошельки</Name>
			<Comment>Банк, Наличные, Акции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачальногоОстатка</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ОсновнойКошелек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОсновнойКошелек</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Кошельки/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	Если НЕ ПометкаУдаления Тогда
		
	
	Если НЕ ЭтоГруппа Тогда
		
		
		// создадим запись в регистре основных кошельков
		РС = РегистрыСведений.ОсновнойКошелек.СоздатьНаборЗаписей();
		РС.Отбор.Кошелек.Установить(Ссылка);
		РС.Прочитать();
		Если РС.Количество() = 0 Тогда
			Запись = РС.Добавить();
			Запись.Период = ТекущаяДата();
			Запись.Кошелек = Ссылка;
			Запись.Основной = Основной;
		ИначеЕсли РС.Количество() = 1 Тогда
			Запись = РС[0];
			Запись.Основной = Основной;
		КонецЕсли;
		РС.Записать(Истина);
		
		// если кошелек выбран основным то очистим записи, чтобы не было других основных
		Если Основной Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	ОсновнойКошелек.Кошелек КАК Кошелек
			|ИЗ
			|	РегистрСведений.ОсновнойКошелек КАК ОсновнойКошелек
			|ГДЕ
			|	ОсновнойКошелек.Кошелек <> &Кошелек
			|	И ОсновнойКошелек.Основной");
			Запрос.УстановитьПараметр("Кошелек",Ссылка);
			Выборка = Запрос.Выполнить().Выбрать(); 
			Пока Выборка.Следующий() Цикл
				ВыбСсылка = Выборка.Кошелек;
				Объект = ВыбСсылка.ПолучитьОбъект();
				Объект.Основной = Ложь;	
			КонецЦикла;
		КонецЕсли;
		
		Если НачальныйОстаток <> 0 Тогда
			ДокНачальныйОстаток = Документы.НачальныйОстаток.СоздатьДокумент();
			ДокНачальныйОстаток.Дата = ТекущаяДата();
			ДокНачальныйОстаток.Кошелек = Ссылка;
			ДокНачальныйОстаток.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
КонецЕсли;
КонецПроцедуры
